3.1 Warm Up Exercises:
1. Sorting and Subsetting:
Complete all following Task:<br>

• Dataset for the Task: "titanic.csv"
Following task is common for all the problem:
1. Load the provided dataset and import in pandas DataFrame.
2. Check info of the DataFrame and identify following:

In [2]:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Concept and Technology of AI/Titanic-Dataset.csv")
print(df.info())
print(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

Problem 1 - Sorting:
1. Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
head of the result.

In [3]:
fare = df[['Fare']]
print(fare.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

2. Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
dataset, in that order. Print the head of the result.

In [4]:
class_age = df[['Pclass', 'Age']]
print(class_age.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
Titanic dataset, in that order.Print the head of the result.

In [5]:
survived_gender = df[['Survived', 'Sex']]
print(survived_gender.head())

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:
Complete all the following Task:
Subsetting Rows:
1. Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
to fare gt 100.View the printed result.

In [8]:
fare_gt_100 = df[df['Fare'] > 100]
print(fare_gt_100.head())

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

2. Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
first class.View the printed result.

In [9]:
first_class = df[df['Pclass'] == 1]
print(first_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

3. Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
is female (Sex is "female"), assigning it to female under 18. View the printed result.

In [10]:
female_under_18 = df[(df['Age'] < 18) & (df['Sex'] == 'female')]
print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

Subsetting Rows by Categorical variables:
1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
(Southampton), assigning the result to embarked c or s. View the printed result.

In [11]:
embark_c_or_s = df[df['Embarked'].isin(['C', 'S'])]
print(embark_c_or_s.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
or second class), assigning the result to first second class.View the printed result.

In [12]:
first_second_class = df[df['Pclass'].isin([1, 2])]
print(first_second_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

3.2 Exploratory Data Analysis Practice Exercise - 1.<br>
Warning: Handle missing values in the Age column by filling them with the median age of the dataset before performing the division.

Answer the following questions from Dataset:
Which passenger had the highest fare paid relative to their age?
To answer the question perform following operations:

In [14]:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Concept and Technology of AI/Titanic-Dataset.csv")
df['Age'] = df['Age'].fillna(df['Age']).median()

1. Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
the passenger(i.e., Fare/Age).

In [17]:
df['fare_per_year'] = df['Fare'] / df['Age']
print(df['fare_per_year'].head())

0    0.258929
1    2.545832
2    0.283036
3    1.896429
4    0.287500
Name: fare_per_year, dtype: float64

2. Subset rows where fare per year is higher than 5, assigning this to high fare age.

In [19]:
high_fare_age = df[df['fare_per_year'] > 5]
print(high_fare_age.head())

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  28.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female  28.0      1
88                       Fortune, Miss. Mabel Helen  female  28.0      3
118                        Baxter, Mr. Quigg Edmond    male  28.0      0
195                            Lurette, Miss. Elise  female  28.0      0

     Parch    Ticket      Fare        Cabin Embarked  fare_per_year
27       2     19950  263.0000  C23 C25 C27        S       9.392857
31       0  PC 17569  146.5208          B78        C       5.232886
88       2     19950  263.0000  C23 C25 C27        S       9.392857
118      1  PC 17558  247.5208      B58 B60        C       8.840029
195      0  PC 17569  146.5208          B80        C       5.232886

3. Sort high fare age by descending fare per year, assigning this to high fare age srt.

In [23]:
high_fare_age_srt = high_fare_age.sort_values('fare_per_year', ascending=False)
print(high_fare_age_srt.head())

     PassengerId  Survived  Pclass                                Name  \
258          259         1       1                    Ward, Miss. Anna
737          738         1       1              Lesurer, Mr. Gustave J
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez
341          342         1       1      Fortune, Miss. Alice Elizabeth
438          439         0       1                   Fortune, Mr. Mark

        Sex   Age  SibSp  Parch    Ticket      Fare        Cabin Embarked  \
258  female  28.0      0      0  PC 17755  512.3292          NaN        C
737    male  28.0      0      0  PC 17755  512.3292         B101        C
679    male  28.0      0      1  PC 17755  512.3292  B51 B53 B55        C
341  female  28.0      3      2     19950  263.0000  C23 C25 C27        S
438    male  28.0      1      4     19950  263.0000  C23 C25 C27        S

     fare_per_year
258      18.297471
737      18.297471
679      18.297471
341       9.392857
438       9.392857

4. Select only the Name and fare per year columns of high fare age srt and save the result as result.

In [28]:
result1 = high_fare_age_srt[['Name', 'fare_per_year']]
print(result1.head())

                                   Name  fare_per_year
258                    Ward, Miss. Anna      18.297471
737              Lesurer, Mr. Gustave J      18.297471
679  Cardeza, Mr. Thomas Drake Martinez      18.297471
341      Fortune, Miss. Alice Elizabeth       9.392857
438                   Fortune, Mr. Mark       9.392857

the passenger at the top is the one who paid the most relative to their age.

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?
To answer the question perform following operations:
1. Add a column to the Titanic dataset, fare per class, containing the fare divided by the passenger
class i.e. Fare / Pclass.

In [25]:
df['fare_per_class'] = df['Fare'] / df['Pclass']
print(df['fare_per_class'].head())

0     2.416667
1    71.283300
2     2.641667
3    53.100000
4     2.683333
Name: fare_per_class, dtype: float64

2. Subset rows where the passenger is male (Sex is ”male”) and an adult (Age is greater than or equal
to 18), assigning this to adult males.

In [26]:
adult_males = df[(df['Sex'] == 'male') & (df['Age'] >= 18)]
print(adult_males.head())

   PassengerId  Survived  Pclass                            Name   Sex   Age  \
0            1         0       3         Braund, Mr. Owen Harris  male  28.0
4            5         0       3        Allen, Mr. William Henry  male  28.0
5            6         0       3                Moran, Mr. James  male  28.0
6            7         0       1         McCarthy, Mr. Timothy J  male  28.0
7            8         0       3  Palsson, Master. Gosta Leonard  male  28.0

   SibSp  Parch     Ticket     Fare Cabin Embarked  fare_per_year  \
0      1      0  A/5 21171   7.2500   NaN        S       0.258929
4      0      0     373450   8.0500   NaN        S       0.287500
5      0      0     330877   8.4583   NaN        Q       0.302082
6      0      0      17463  51.8625   E46        S       1.852232
7      3      1     349909  21.0750   NaN        S       0.752679

   fare_per_class
0        2.416667
4        2.683333
5        2.819433
6       51.862500
7        7.025000

3. Sort adult males by descending fare per class, assigning this to adult males srt.

In [27]:
adult_males_srt = adult_males.sort_values('fare_per_class', ascending=False)
print(adult_males_srt.head())

     PassengerId  Survived  Pclass                                Name   Sex  \
737          738         1       1              Lesurer, Mr. Gustave J  male
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez  male
438          439         0       1                   Fortune, Mr. Mark  male
27            28         0       1      Fortune, Mr. Charles Alexander  male
118          119         0       1            Baxter, Mr. Quigg Edmond  male

      Age  SibSp  Parch    Ticket      Fare        Cabin Embarked  \
737  28.0      0      0  PC 17755  512.3292         B101        C
679  28.0      0      1  PC 17755  512.3292  B51 B53 B55        C
438  28.0      1      4     19950  263.0000  C23 C25 C27        S
27   28.0      3      2     19950  263.0000  C23 C25 C27        S
118  28.0      0      1  PC 17558  247.5208      B58 B60        C

     fare_per_year  fare_per_class
737      18.297471        512.3292
679      18.297471        512.3292
438       9.392857        263.0000
27        9.392857        263.0000
118       8.840029        247.5208

4. Select only the Name, Age, and fare per class columns of adult males sr and save the result
as result.

In [29]:
result2 = adult_males_srt[['Name', 'Age', 'fare_per_class']]
print(result2.head())

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  28.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  28.0        512.3292
438                   Fortune, Mr. Mark  28.0        263.0000
27       Fortune, Mr. Charles Alexander  28.0        263.0000
118            Baxter, Mr. Quigg Edmond  28.0        247.5208

The first row of adult male who paid the highest fare relative to the class.

3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:
Based on the dataset Answer the following question:
What percent of the total fare revenue came from each passenger class?
To answer the question perform following operation:
1. Calculate the total Fare paid across all passengers in the Titanic dataset.

In [32]:
total_fare = df['Fare'].sum()
print("Total Fare: ",total_fare)

Total Fare:  28693.9493

2. Subset for passengers in first class (Pclass is 1) and calculate their total fare.

In [35]:
fare1 = df[df['Pclass'] == 1]['Fare'].sum()
print("Fare1: ",fare1)

Fare1:  18177.4125

3. Do the same for second class (Pclass is 2) and third class (Pclass is 3).

In [34]:
fare2 = df[df['Pclass'] == 2]['Fare'].sum()
print("Fare2: ",fare2)
fare3 = df[df['Pclass'] == 3]['Fare'].sum()
print("Fare3: ",fare3)

Fare2:  3801.8417
Fare3:  6714.6951

4. Combine the fare totals from first, second, and third classes into a list.

In [37]:

fare_list = [fare1, fare2, fare3]
print(fare_list)

[np.float64(18177.4125), np.float64(3801.8417), np.float64(6714.6951)]

5. Divide the totals for each class by the overall total fare to get the proportion of fare revenue by class.

In [52]:
percentage = [(fare / total_fare) * 100 for fare in fare_list]
print(percentage)

[np.float64(63.349287718996564), np.float64(13.24962855496507), np.float64(23.401083726038365)]

What percent of the total number of passengers on the Titanic belonged to each age group
(e.g., child, adult, senior)?
To answer the question perform following operation:
1. Create a new column, age group, that categorizes passengers into "child" (age < 18), "adult" (age
18{64), and "senior" (age 65 and above).

In [41]:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Concept and Technology of AI/Titanic-Dataset.csv")

In [44]:
def age_group(age):
  if pd.isnull(age):
    return None
  elif age < 18:
    return "child"
  elif 18 <=age < 65:
    return "adult"
  else:
    return "Senior"

df['AgeGroup'] = df['Age'].apply(age_group)
print(df['AgeGroup'].head())

0    adult
1    adult
2    adult
3    adult
4    adult
Name: AgeGroup, dtype: object

2. Calculate the total number of passengers on the Titanic.

In [45]:
total_passengers = df["AgeGroup"].count()
print(total_passengers)

714

3. Count the number of passengers in each age group.

In [46]:
group_counts = df["AgeGroup"].value_counts()
print(group_counts)

AgeGroup
adult     590
child     113
Senior     11
Name: count, dtype: int64

4. Divide the count of each age group by the total number of passengers to get the proportion of passengers
in each age group.

In [49]:
group_per = (group_counts / total_passengers) * 100

5. Display the proportion as a percentage.

In [50]:
group_per = group_per.round(4)
print(group_per.round)

<bound method Series.round of AgeGroup
adult     82.6331
child     15.8263
Senior     1.5406
Name: count, dtype: float64>